分工：
一：页面分析：
尖叫设计网官网一共八个页面我们的小组一共是三个人每个人负责两个页面，剩下的两个页面一个由我负责另一个页面由另外两个人负责，页面分为：“推荐”，“家具”，“家居”“活动”“首页”“分类”“购物车”“消息”“我的”，页面含有轮播图。
二：小组分工：
Vue路由搭建：石
前端：
纪：下导航页面的搭建和布局家居页以及动画的实现
石：首页 家具 购物车 的页面的布局以及动画的实现
李：活动 消息  我的页面的布局以及动画的实现
后端：
我们的网站是前后端分离的，所以我们所请求的数据都是从原网站的接口请求出来的
三：使用框架
主体框架：VUE
代码管理工具:git  仓库地址：https://github.com/shiyepeng/jianjiao.git
前构建工具：webpack
总结：
项目名称：尖叫设计官网
原项目网址：https://m.wowdsgn.com
运用框架：VUE
开发方式：前后端分离
代码的管理工具：git
仓库管理员：石
前端构建工具：webpack
仓库地址：https://github.com/shiyepeng/jianjiao.git
技术清单：VUE sass VUEX swiper axios
小组成员：石 李 纪